let LatestOSVersions = datatable(OSPlatform:string, LatestBuild:string) [
    "Windows11", "10.0.26100.4946",
    "Windows10", "10.0.19045.6216",
    "macOS", "15.6.1.0"
];

DeviceTvmSoftwareInventory
| join kind=inner LatestOSVersions on OSPlatform
| join kind=inner (
    DeviceInfo
    | where DeviceType == "Workstation"
    | project DeviceId, DeviceType
) on DeviceId
| project DeviceId, OSPlatform, OSVersion,
          IsUpToDate = iff(OSVersion == LatestBuild, "Yes", "No")
| summarize TotalDevices = dcount(DeviceId), UpToDate = dcountif(DeviceId, IsUpToDate == "Yes")
| extend PercentUpToDate = round(100.0 * todouble(UpToDate) / TotalDevices, 2)
