let CertList = externaldata(SubjectCN: string, File: string)
[""]
with (format="csv", ignoreFirstRecord=true);

DeviceFileCertificateInfo
| join kind=inner (DeviceInfo| where DeviceType == "Workstation" | project DeviceId, DeviceType) on DeviceId
| join kind=leftouter (
    DeviceTvmSoftwareInventory
    | where isnotempty(OSPlatform)
    | where OSPlatform in~ ("Windows11", "Windows10")
    | where OSPlatform !contains "Server" and OSPlatform !contains "WVD"
) on DeviceId
| join kind=leftouter (
    CertList
    | project SubjectCN
) on $left.Signer == $right.SubjectCN
| project DeviceId, DeviceType, OSPlatform, Signer,
          HasPasswordManager = iff(isnotempty(SubjectCN), "Yes", "No")
