let CertList = externaldata(FileName: string, Signer: string)
["https://raw.githubusercontent.com/LimoWagdy/BehaviourMetrics/refs/heads/main/Inventory/PasswordManagers.csv"]
with (format="csv", ignoreFirstRecord=true);

let Devices = DeviceTvmSoftwareInventory
| where isnotempty(OSPlatform)
| where OSPlatform in~ ("Windows11", "Windows10")
| where OSPlatform !contains "Server" and OSPlatform !contains "WVD"
| join kind=inner (DeviceInfo | where DeviceType == "Workstation" | project DeviceId, DeviceType) on DeviceId
| distinct DeviceId;

Devices
| join kind=inner (DeviceFileCertificateInfo | project DeviceId, SHA1, Signer) on DeviceId
| join kind=inner (
    DeviceFileEvents
    | project DeviceId, SHA1, FileName
) on DeviceId, SHA1
| join kind=leftouter (
    CertList
    | project FileName, Signer
) on FileName, Signer
| summarize Use = iff(countif(FileName in (CertList)) > 0, "Yes", "No") by DeviceId
| summarize TotalDevices = dcount(DeviceId), Devices = dcountif(DeviceId, Use == "Yes")
| extend PercentUsePM = round(100.0 * todouble(Devices) / TotalDevices, 2);
