let CertList = externaldata(SubjectCN: string, File: string)
[""]
with (format="csv", ignoreFirstRecord=true);

DeviceFileCertificateInfo
| join kind=inner (DeviceInfo| where DeviceType == "Workstation" | project DeviceId, DeviceType) on DeviceId
| join kind=leftouter (
    DeviceTvmSoftwareInventory
    | where OSPlatform !in~ ("IOS", "Android", "Linux", "Windows", "macOS", "Windows8", "Windows7", "WindowsXp", "WindowsVista")
    | where OSPlatform !contains "Server" and OSPlatform !contains "WVD"
    | where isnotempty(OSPlatform)
) on DeviceId
| join kind=leftouter (
    LocalCertList
    | project SubjectCN, Category
) on $left.Signer == $right.SubjectCN
project 
