let password_breach_techniques = dynamic([
    "T1110"         // Brute force
]);
SecurityIncident
| where TimeGenerated > ago(1d)
| where Classification != "FalsePositive"
| where Severity != "Informational"
| where Status != "Closed"
| extend techniquesArray = parse_json(AdditionalData).techniques
| where techniquesArray has_any(password_breach_techniques)
| project TimeGenerated, Title, Description, Severity, Status, AdditionalData, techniquesArray
