let social_engineering_techniques = dynamic([
    "T1110",         // Brute force
    "T1555",         // Credentials from password stores
    "T1003",         // OS credential dumping
    "T1081"         // Credentials in files
]);
SecurityIncident
| where TimeGenerated > ago(1d)
| where Classification != "FalsePositive"
| where Severity != "Informational"
| where Status != "Closed"
| extend techniquesArray = parse_json(AdditionalData).techniques
| where techniquesArray has_any(social_engineering_techniques)
| project TimeGenerated, Title, Description, Severity, Status, AdditionalData, techniquesArray
